Repository: AhmedShehatah/Schooly
Catalog: lib/core/localization/app_*.arb
Languages: ar

# requestCancelled
source: The request to the server has been cancelled
ar: تم إلغاء الطلب إلى الخادم

# connectionTimeout
source: The connection to the server timed out
ar: انتهت مهلة الاتصال بالخادم

# receiveTimeout
source: The connection to the server has timed out
ar: انتهت مهلة استلام الاتصال بالخادم

# sendTimeout
source: The connection to the server has timed out
ar: انتهت مهلة إرسال الاتصال للخادم

# connectionError
source: No internet connection
ar: لا يوجد اتصال بالانترنت

# unknownError
source: An unexpected error occurred
ar: حدث خطأ غير متوقع

# serverError
source: A server error has occurred
ar: حدث خطأ في الخادم

# badCertificate
source: Error in security certificate
ar: خطأ في الشهادة الأمنية

# sessionExpired
source: Session has expired
ar: لقد انتهت الجلسة

source: Password
ar: كلمة المرور

# identityNumberValidation
source: Identity number must be at least 7 digits
ar: رقم الهوية يجب أن لا يقل عن ٧ أرقام

# mustEnter
source: Must enter {value}
ar: يجب ادخال {value}

# mustLogin
source: You must login first
ar: يجب عليك تسجيل الدخول

source: Login
ar: تسجيل الدخول

source: Forgot Password?
ar: هل نسيت كلمة السر؟

source: Invalid phone number
ar: رقم الجوال غير صحيح

source: National ID
ar: رقم الهوية

source: Country
ar: الدولة

source: Choose Country
ar: اختر الدولة

source: Phone Number
ar: رقم الجوال

# invalidEmail
source: Email is incorrect
ar: البريد الالكتروني غير صحيح

source: Email
ar: البريد الإلكتروني

# otpValidation
source: The verification code must be 4 digits long
ar: يجب ان يكون رقم التحقق المكون من ٤ ارقام

source: Your Upcoming Classes
ar: حصصك القادمة

source: All
ar: الكل

# nSeconds
source: {second, plural, =1{1 Second} other{{second} Seconds}}
ar: {second, plural, =0{٠ ثوانٍ} =1{ثانية} =2{ثانيتين} few{{second} ثوانٍ} many{{second} ثانية} other{{second} ثانية}}

# nMinutes
source: {minute, plural, =1{1 Minute} other{{minute} Minutes}}
ar: {minute, plural, =0{٠ دقائق} =1{دقيقة} =2{دقيقتين} few{{minute} دقائق} many{{minute} دقيقة} other{{minute} دقيقة}}

# nHours
source: {hour, plural, =1{1 Hour} other{{hour} Hours}}
ar: {hour, plural, =0{٠ ساعات} =1{ساعة} =2{ساعتين} few{{hour} ساعات} many{{hour} ساعة} other{{hour} ساعة}}

# nDays
source: {day, plural, =1{1 Day} other{{day} Days}}
ar: {day, plural, =0{٠ أيام} =1{يوم} =2{يومين} few{{day} أيام} many{{day} يوم} other{{day} يوم}}

# nMonths
source: {month, plural, =1{1 Month} other{{month} Months}}
ar: {month, plural, =0{٠ أشهر} =1{شهر} =2{شهرين} few{{month} أشهر} many{{month} شهر} other{{month} شهر}}

# nYears
source: {year, plural, =1{1 Year} other{{year} Years}}
ar: {year, plural, =0{٠ سنوات} =1{سنة} =2{سنتين} few{{year} سنوات} many{{year} سنة} other{{year} سنة}}

source: Teacher
ar: المعلم

source: Lesson Type
ar: نوع الجلسة

source: Date
ar: التاريخ

source: From
ar: من

source: To
ar: الى
